yukicoder/memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-28 Tue 14:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>yukicoder</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pop-ketle" />
<link rel="stylesheet" type="text/css" href="../orgmode_styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../orgmode_styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">yukicoder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0077286">1. difficulty1.5</a>
<ul>
<li><a href="#org11d46c0">1.1. No.882 約数倍数</a></li>
<li><a href="#org9b87b19">1.2. No.888 約数の総和</a></li>
<li><a href="#orga8d5172">1.3. No.889 素数!</a></li>
</ul>
</li>
<li><a href="#org8211f7b">2. difficulty2.0</a>
<ul>
<li><a href="#orgd24ffb4">2.1. No.3 ビットすごろく</a></li>
<li><a href="#org7f7c011">2.2. No.7 プライムナンバーゲーム</a></li>
<li><a href="#org639932b">2.3. No.8  N言っちゃダメゲーム</a></li>
<li><a href="#org3bbb265">2.4. No.11 カードマッチ</a></li>
<li><a href="#org0e89e3e">2.5. No.16 累乗の加算</a></li>
<li><a href="#org1e14feb">2.6. No.36 素数が嫌い！</a></li>
<li><a href="#org7ce859a">2.7. No.39 桁の数字を入れ替え</a></li>
<li><a href="#org7b2255b">2.8. No.44 DPなすごろく</a></li>
<li><a href="#org3c59c71">2.9. No.45 回転寿司</a></li>
<li><a href="#org686afb8">2.10. No.52 よくある文字列の問題</a></li>
<li><a href="#org5a393b5">2.11. No.71 そろばん</a></li>
<li><a href="#org7b903dd">2.12. No.675 テトラナッチ数列 Easy</a></li>
<li><a href="#orgc86b579">2.13. No.786 京都大学の過去問</a></li>
<li><a href="#org5782a56">2.14. No.938 賢人を探せ</a></li>
<li><a href="#org9b83e44">2.15. No.4 おもりと天秤</a></li>
</ul>
</li>
<li><a href="#org9421635">3. difficulty2.5</a>
<ul>
<li><a href="#org45dd2f7">3.1. No.4 おもりと天秤</a></li>
</ul>
</li>
<li><a href="#orga42a093">4. difficulty3.0</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>最終更新日 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-28 Tue&gt;</span></span><br /></li>
</ul>

<p>
問題の解法・学んだことのメモを書きます。<br />
</p>

<div id="outline-container-org0077286" class="outline-2">
<h2 id="org0077286"><span class="section-number-2">1</span> difficulty1.5</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org11d46c0" class="outline-3">
<h3 id="org11d46c0"><span class="section-number-3">1.1</span> <a href="./difficulty1.5/no882.py">No.882 約数倍数</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
期間が空いたのでうろ覚えだが約数列挙かな<br />
制約が緩いので愚直にできそう<br />
</p>
</div>
</div>

<div id="outline-container-org9b87b19" class="outline-3">
<h3 id="org9b87b19"><span class="section-number-3">1.2</span> <a href="./difficulty1.5/no888.py">No.888 約数の総和</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
約数を列挙して総和をだす<br />
1≤i≤N じゃなくて 1≤i≤√Nで良いぞってやつ<br />
</p>
</div>
</div>

<div id="outline-container-orga8d5172" class="outline-3">
<h3 id="orga8d5172"><span class="section-number-3">1.3</span> <a href="./difficulty1.5/no889.py">No.889 素数!</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
素数、平方数、立方数、完全数かをチェックする<br />
制約が緩いので手動列挙して解いたが制約がきつくなった時にどうすべきかは考えておいても良いかも<br />
</p>
</div>
</div>
</div>


<div id="outline-container-org8211f7b" class="outline-2">
<h2 id="org8211f7b"><span class="section-number-2">2</span> difficulty2.0</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd24ffb4" class="outline-3">
<h3 id="orgd24ffb4"><span class="section-number-3">2.1</span> <a href="./difficulty2.0/no3.py">No.3 ビットすごろく</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
すごろく最短解探索 幅優先探索<br />
</p>
</div>
</div>

<div id="outline-container-org7f7c011" class="outline-3">
<h3 id="org7f7c011"><span class="section-number-3">2.2</span> <a href="./difficulty2.0/no7.py">No.7 プライムナンバーゲーム</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
エラストテネスなんかで素数列挙しておいてからdpで勝敗を決める<br />
素数列挙とgrundy数を組み合わせた良問<br />
</p>
</div>
</div>

<div id="outline-container-org639932b" class="outline-3">
<h3 id="org639932b"><span class="section-number-3">2.3</span> <a href="./difficulty2.0/no8.py">No.8  N言っちゃダメゲーム</a></h3>
<div class="outline-text-3" id="text-2-3">
<p>
n-1を言えば勝てるゲーム<br />
ゲームの存在は知っていたが必勝法を忘れてて思いつかなかったので(じゃあダメじゃん(はい&#x2026;))、LayCurseさんの<a href="http://rsujskf.s602.xrea.com/?yukicoder_8">yukicoder No.8 - N言っちゃダメゲーム</a><br />
&gt;「また，相手が何を言おうと，K+1 から相手が言った整数を引いた数をいうことができる．つまり，N−1−(K+1) を言えば，勝てる．と続けていくと，N mod (K+1) が 1 の時のみ後手必勝」<br />
</p>

<p>
をみて解いた記憶がある 問題文にも書いてあるけど知識ゲー感<br />
</p>
</div>
</div>

<div id="outline-container-org3bbb265" class="outline-3">
<h3 id="org3bbb265"><span class="section-number-3">2.4</span> <a href="./difficulty2.0/no11.py">No.11 カードマッチ</a></h3>
<div class="outline-text-3" id="text-2-4">
<p>
包除原理を使った問題 数学<br />
</p>
</div>
</div>

<div id="outline-container-org0e89e3e" class="outline-3">
<h3 id="org0e89e3e"><span class="section-number-3">2.5</span> <a href="./difficulty2.0/no16.py">No.16 累乗の加算</a></h3>
<div class="outline-text-3" id="text-2-5">
<p>
x^10000000的なめっちゃ乗算する問題  <br />
解くだけだと思ったがx**iのような乗算方法だと計算時間を食いTLEするらしい<br />
繰り返し二乗法なるものがあるらしいがPythonにおいてはpow()を使えば良いっぽい<br />
余談だがpow()ってmodも取れるのね<br />
</p>
</div>
</div>

<div id="outline-container-org1e14feb" class="outline-3">
<h3 id="org1e14feb"><span class="section-number-3">2.6</span> <a href="./difficulty2.0/no36.py">No.36 素数が嫌い！</a></h3>
<div class="outline-text-3" id="text-2-6">
<p>
素因数分解して素数,1,使う数自身」以外で割り切れる整数かどうかを判定する<br />
エラストテンネスで素数列挙しようとしたらMLEした<br />
</p>
</div>
</div>

<div id="outline-container-org7ce859a" class="outline-3">
<h3 id="org7ce859a"><span class="section-number-3">2.7</span> <a href="./difficulty2.0/no39.py">No.39 桁の数字を入れ替え</a></h3>
<div class="outline-text-3" id="text-2-7">
<p>
制約が緩いので全パターンを列挙して条件に合うもので最大のものを出力するだけ<br />
itertoolsがすごいと、最初一番上の桁だけ入れ替えるプログラムを書いてWA出したのが反省点<br />
</p>
</div>
</div>

<div id="outline-container-org7b2255b" class="outline-3">
<h3 id="org7b2255b"><span class="section-number-3">2.8</span> <a href="./difficulty2.0/no44.py">No.44 DPなすごろく</a></h3>
<div class="outline-text-3" id="text-2-8">
<p>
dp典型 特に難しくなさそう<br />
</p>
</div>
</div>

<div id="outline-container-org3c59c71" class="outline-3">
<h3 id="org3c59c71"><span class="section-number-3">2.9</span> <a href="./difficulty2.0/no45.py">No.45 回転寿司</a></h3>
<div class="outline-text-3" id="text-2-9">
<p>
dp 続けて取れないので下のようになる<br />
</p>
<pre class="example">
dp[i]=max(dp[i-2]+V[i],dp[i-1])
</pre>
</div>
</div>

<div id="outline-container-org686afb8" class="outline-3">
<h3 id="org686afb8"><span class="section-number-3">2.10</span> <a href="./difficulty2.0/no52.py">No.52 よくある文字列の問題</a></h3>
<div class="outline-text-3" id="text-2-10">
<p>
簡単そうに見えたけど意外と手間取った<br />
bit全探索使って全パターンを作成してsetに入れて長さを取ればok<br />
</p>
</div>
</div>

<div id="outline-container-org5a393b5" class="outline-3">
<h3 id="org5a393b5"><span class="section-number-3">2.11</span> <a href="./difficulty2.0/no71.py">No.71 そろばん</a></h3>
<div class="outline-text-3" id="text-2-11">
<p>
全探索して探す問題 そんなに難しくない<br />
</p>
</div>
</div>

<div id="outline-container-org7b903dd" class="outline-3">
<h3 id="org7b903dd"><span class="section-number-3">2.12</span> <a href="./difficulty2.0/no675.py">No.675 テトラナッチ数列 Easy</a></h3>
<div class="outline-text-3" id="text-2-12">
<p>
メモ化再帰でするっと解ける 典型<br />
</p>
</div>
</div>

<div id="outline-container-orgc86b579" class="outline-3">
<h3 id="orgc86b579"><span class="section-number-3">2.13</span> <a href="./difficulty2.0/no786.py">No.786 京都大学の過去問</a></h3>
<div class="outline-text-3" id="text-2-13">
<p>
1段もしくは2段飛ばしのdp典型<br />
ところでこれ本当に京都大学の過去問なんですか？<br />
</p>
</div>
</div>

<div id="outline-container-org5782a56" class="outline-3">
<h3 id="org5782a56"><span class="section-number-3">2.14</span> <a href="./difficulty2.0/no938.py">No.938 賢人を探せ</a></h3>
<div class="outline-text-3" id="text-2-14">
<p>
setとか使ってカンニングしていない人リストを作成する<br />
余談だが、出力の際に整列をさせる必要があり上だとTLEする<br />
下の方が in を使ってる分遅そうな気がするが&#x2026;<br />
多分remove()を使って要素が削除されるにつれ早くなるようにしているのだろう<br />
このやり方は覚えておいて損がないかもしれない<br />
</p>
<pre class="example">
# nocheater=sorted(set(nocheater),key=person.index)
# print(*nocheater,sep="\n")

for p in person:
    if p in nocheater:
        print(p)
        nocheater.remove(p)
</pre>
</div>
</div>

<div id="outline-container-org9b83e44" class="outline-3">
<h3 id="org9b83e44"><span class="section-number-3">2.15</span> <a href="./difficulty2.0/no954.py">No.4 おもりと天秤</a></h3>
<div class="outline-text-3" id="text-2-15">
<p>
メモ化再帰でフィボナッチ数列作成<br />
</p>
</div>
</div>
</div>


<div id="outline-container-org9421635" class="outline-2">
<h2 id="org9421635"><span class="section-number-2">3</span> difficulty2.5</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org45dd2f7" class="outline-3">
<h3 id="org45dd2f7"><span class="section-number-3">3.1</span> <a href="./difficulty2.5/no4.py">No.4 おもりと天秤</a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
dp 期間が空いたので正直覚えてないがREを連発している<br />
コードを見る感じlist out of index関係っぽい？<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orga42a093" class="outline-2">
<h2 id="orga42a093"><span class="section-number-2">4</span> difficulty3.0</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pop-ketle</p>
<p class="date">Created: 2020-07-28 Tue 14:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>